benchmarks/results/auth-serialization/test-serialization/test-msgspec/wrk2-logs/run_1_1305_1158.txt
Running 30s test @ http://127.0.0.1:8000/serialization-msgspec
  2 threads and 6 connections
  Thread calibration: mean lat.: 2.137ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.132ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.01ms  520.86us   4.30ms   69.88%
    Req/Sec   317.05     50.33   555.00     86.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.02ms
 75.000%    2.33ms
 90.000%    2.66ms
 99.000%    3.32ms
 99.900%    3.51ms
 99.990%    3.83ms
 99.999%    4.30ms
100.000%    4.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.722     0.000000            1         1.00
       1.314     0.100000         1200         1.11
       1.567     0.200000         2399         1.25
       1.775     0.300000         3601         1.43
       1.895     0.400000         4801         1.67
       2.015     0.500000         5998         2.00
       2.071     0.550000         6614         2.22
       2.127     0.600000         7217         2.50
       2.187     0.650000         7807         2.86
       2.251     0.700000         8396         3.33
       2.327     0.750000         8993         4.00
       2.371     0.775000         9302         4.44
       2.407     0.800000         9606         5.00
       2.449     0.825000         9906         5.71
       2.501     0.850000        10202         6.67
       2.561     0.875000        10493         8.00
       2.603     0.887500        10642         8.89
       2.657     0.900000        10792        10.00
       2.717     0.912500        10944        11.43
       2.777     0.925000        11093        13.33
       2.847     0.937500        11244        16.00
       2.883     0.943750        11320        17.78
       2.915     0.950000        11396        20.00
       2.949     0.956250        11466        22.86
       2.983     0.962500        11543        26.67
       3.025     0.968750        11618        32.00
       3.047     0.971875        11653        35.56
       3.071     0.975000        11691        40.00
       3.109     0.978125        11728        45.71
       3.151     0.981250        11766        53.33
       3.195     0.984375        11803        64.00
       3.225     0.985938        11822        71.11
       3.277     0.987500        11841        80.00
       3.307     0.989062        11862        91.43
       3.337     0.990625        11879       106.67
       3.371     0.992188        11897       128.00
       3.383     0.992969        11907       142.22
       3.401     0.993750        11919       160.00
       3.405     0.994531        11925       182.86
       3.423     0.995313        11934       213.33
       3.437     0.996094        11944       256.00
       3.443     0.996484        11949       284.44
       3.447     0.996875        11954       320.00
       3.453     0.997266        11958       365.71
       3.475     0.997656        11962       426.67
       3.489     0.998047        11969       512.00
       3.489     0.998242        11969       568.89
       3.495     0.998437        11972       640.00
       3.503     0.998633        11974       731.43
       3.507     0.998828        11976       853.33
       3.531     0.999023        11979      1024.00
       3.537     0.999121        11980      1137.78
       3.539     0.999219        11981      1280.00
       3.545     0.999316        11982      1462.86
       3.547     0.999414        11983      1706.67
       3.671     0.999512        11985      2048.00
       3.671     0.999561        11985      2275.56
       3.681     0.999609        11986      2560.00
       3.681     0.999658        11986      2925.71
       3.735     0.999707        11987      3413.33
       3.775     0.999756        11988      4096.00
       3.775     0.999780        11988      4551.11
       3.775     0.999805        11988      5120.00
       3.775     0.999829        11988      5851.43
       3.825     0.999854        11989      6826.67
       3.825     0.999878        11989      8192.00
       3.825     0.999890        11989      9102.22
       3.825     0.999902        11989     10240.00
       3.825     0.999915        11989     11702.86
       4.299     0.999927        11990     13653.33
       4.299     1.000000        11990          inf
#[Mean    =        2.005, StdDeviation   =        0.521]
#[Max     =        4.296, Total count    =        11990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 0.92GB read
Requests/sec:    599.95
Transfer/sec:     31.47MB