benchmarks/results/auth-serialization/test-serialization/test-msgspec/wrk2-logs/run_2_1305_1159.txt
Running 30s test @ http://127.0.0.1:8000/serialization-msgspec
  2 threads and 6 connections
  Thread calibration: mean lat.: 1.884ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.837ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.85ms  473.95us   3.77ms   67.37%
    Req/Sec   316.94     59.72   555.00     77.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.84ms
 75.000%    2.19ms
 90.000%    2.46ms
 99.000%    2.93ms
 99.900%    3.39ms
 99.990%    3.66ms
 99.999%    3.77ms
100.000%    3.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.694     0.000000            1         1.00
       1.202     0.100000         1206         1.11
       1.454     0.200000         2402         1.25
       1.595     0.300000         3601         1.43
       1.715     0.400000         4799         1.67
       1.839     0.500000         6002         2.00
       1.910     0.550000         6602         2.22
       1.985     0.600000         7207         2.50
       2.053     0.650000         7813         2.86
       2.119     0.700000         8397         3.33
       2.189     0.750000         8996         4.00
       2.227     0.775000         9306         4.44
       2.267     0.800000         9598         5.00
       2.305     0.825000         9893         5.71
       2.353     0.850000        10200         6.67
       2.403     0.875000        10499         8.00
       2.429     0.887500        10644         8.89
       2.463     0.900000        10799        10.00
       2.497     0.912500        10942        11.43
       2.533     0.925000        11096        13.33
       2.579     0.937500        11242        16.00
       2.603     0.943750        11319        17.78
       2.629     0.950000        11397        20.00
       2.653     0.956250        11467        22.86
       2.679     0.962500        11544        26.67
       2.709     0.968750        11616        32.00
       2.725     0.971875        11656        35.56
       2.747     0.975000        11696        40.00
       2.771     0.978125        11730        45.71
       2.799     0.981250        11766        53.33
       2.837     0.984375        11803        64.00
       2.859     0.985938        11822        71.11
       2.887     0.987500        11842        80.00
       2.913     0.989062        11860        91.43
       2.957     0.990625        11879       106.67
       3.007     0.992188        11897       128.00
       3.031     0.992969        11906       142.22
       3.063     0.993750        11916       160.00
       3.107     0.994531        11925       182.86
       3.121     0.995313        11934       213.33
       3.151     0.996094        11944       256.00
       3.155     0.996484        11949       284.44
       3.169     0.996875        11953       320.00
       3.211     0.997266        11958       365.71
       3.243     0.997656        11962       426.67
       3.327     0.998047        11967       512.00
       3.337     0.998242        11971       568.89
       3.339     0.998437        11972       640.00
       3.349     0.998633        11974       731.43
       3.365     0.998828        11977       853.33
       3.421     0.999023        11979      1024.00
       3.441     0.999121        11981      1137.78
       3.441     0.999219        11981      1280.00
       3.475     0.999316        11982      1462.86
       3.479     0.999414        11983      1706.67
       3.513     0.999512        11985      2048.00
       3.513     0.999561        11985      2275.56
       3.519     0.999609        11986      2560.00
       3.519     0.999658        11986      2925.71
       3.583     0.999707        11987      3413.33
       3.647     0.999756        11988      4096.00
       3.647     0.999780        11988      4551.11
       3.647     0.999805        11988      5120.00
       3.647     0.999829        11988      5851.43
       3.661     0.999854        11989      6826.67
       3.661     0.999878        11989      8192.00
       3.661     0.999890        11989      9102.22
       3.661     0.999902        11989     10240.00
       3.661     0.999915        11989     11702.86
       3.771     0.999927        11990     13653.33
       3.771     1.000000        11990          inf
#[Mean    =        1.852, StdDeviation   =        0.474]
#[Max     =        3.770, Total count    =        11990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 0.92GB read
Requests/sec:    599.97
Transfer/sec:     31.47MB