benchmarks/results/auth-serialization/test-serialization/test-msgspec/wrk2-logs/run_3_1305_1159.txt
Running 30s test @ http://127.0.0.1:8000/serialization-msgspec
  2 threads and 6 connections
  Thread calibration: mean lat.: 1.727ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.689ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.72ms  550.96us   3.71ms   62.37%
    Req/Sec   318.51     55.31   555.00     83.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.67ms
 75.000%    2.11ms
 90.000%    2.52ms
 99.000%    2.99ms
 99.900%    3.37ms
 99.990%    3.67ms
 99.999%    3.71ms
100.000%    3.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.692     0.000000            1         1.00
       1.015     0.100000         1201         1.11
       1.180     0.200000         2401         1.25
       1.346     0.300000         3597         1.43
       1.536     0.400000         4798         1.67
       1.671     0.500000         5999         2.00
       1.740     0.550000         6598         2.22
       1.830     0.600000         7197         2.50
       1.925     0.650000         7800         2.86
       2.019     0.700000         8393         3.33
       2.111     0.750000         8993         4.00
       2.165     0.775000         9306         4.44
       2.223     0.800000         9597         5.00
       2.293     0.825000         9900         5.71
       2.365     0.850000        10196         6.67
       2.443     0.875000        10495         8.00
       2.481     0.887500        10647         8.89
       2.521     0.900000        10794        10.00
       2.557     0.912500        10943        11.43
       2.589     0.925000        11095        13.33
       2.623     0.937500        11244        16.00
       2.645     0.943750        11318        17.78
       2.667     0.950000        11392        20.00
       2.693     0.956250        11468        22.86
       2.717     0.962500        11545        26.67
       2.755     0.968750        11618        32.00
       2.771     0.971875        11654        35.56
       2.793     0.975000        11692        40.00
       2.815     0.978125        11730        45.71
       2.845     0.981250        11767        53.33
       2.881     0.984375        11803        64.00
       2.901     0.985938        11822        71.11
       2.927     0.987500        11841        80.00
       2.971     0.989062        11860        91.43
       3.001     0.990625        11879       106.67
       3.031     0.992188        11897       128.00
       3.047     0.992969        11906       142.22
       3.083     0.993750        11917       160.00
       3.101     0.994531        11925       182.86
       3.135     0.995313        11934       213.33
       3.179     0.996094        11944       256.00
       3.193     0.996484        11948       284.44
       3.209     0.996875        11953       320.00
       3.231     0.997266        11959       365.71
       3.237     0.997656        11963       426.67
       3.259     0.998047        11968       512.00
       3.265     0.998242        11969       568.89
       3.285     0.998437        11972       640.00
       3.295     0.998633        11975       731.43
       3.341     0.998828        11976       853.33
       3.365     0.999023        11979      1024.00
       3.385     0.999121        11980      1137.78
       3.397     0.999219        11981      1280.00
       3.407     0.999316        11982      1462.86
       3.415     0.999414        11983      1706.67
       3.439     0.999512        11985      2048.00
       3.439     0.999561        11985      2275.56
       3.477     0.999609        11986      2560.00
       3.477     0.999658        11986      2925.71
       3.545     0.999707        11987      3413.33
       3.675     0.999756        11989      4096.00
       3.675     0.999780        11989      4551.11
       3.675     0.999805        11989      5120.00
       3.675     0.999829        11989      5851.43
       3.675     0.999854        11989      6826.67
       3.675     0.999878        11989      8192.00
       3.675     0.999890        11989      9102.22
       3.675     0.999902        11989     10240.00
       3.675     0.999915        11989     11702.86
       3.711     0.999927        11990     13653.33
       3.711     1.000000        11990          inf
#[Mean    =        1.719, StdDeviation   =        0.551]
#[Max     =        3.710, Total count    =        11990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 0.92GB read
Requests/sec:    599.97
Transfer/sec:     31.48MB